index.org
#+OPTIONS: toc:nil num:nil
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../style.css" />
#+TITLE: Introduction au Machine learning
#+AUTHOR: Joon Kwon
#+LANGUAGE: fr
#+DESCRIPTION: Page du cours d'introduction au machine learning, CPES, Université PSL
#+KEYWORDS: joon,kwon,machine learning,cpes,psl,python,scikit-learn
\\

[[https://cpes.univ-psl.fr/cpes/][CPES]] --- [[https://www.psl.eu/][Université PSL]] --- 2019--2020, second semestre\\
Le vendredi de 9h à 12h15 --- Salle L213, [[https://goo.gl/maps/ZMYwEwKdqrE2][MinesParisTech]]\\

Ce cours présente les notions et algorithmes de base de
l'apprentissage supervisé. Il comporte un volet pratique avec de la
programmation en Python et la librairie [[https://scikit-learn.org/][=scikit-learn=]] en particulier.
             
* Calendrier, énoncés et corrections
- 13 mars :: Introduction --- [[file:tp1.pdf][TP]] (correction : [[file:tp1-correction.html][html]], [[file:tp1-correction.ipynb][jupyter]])
- 20 mars :: [[file:chapitre2.pdf][k plus proches voisins]] --- [[file:td2.pdf][TD]] ([[file:td2-correction.pdf][correction]]) --- [[file:tp2.pdf][TP]] (correction : [[file:tp2-correction.html][html]], [[file:tp2-correction.ipynb][jupyter]])
- 27 mars :: [[file:chapitre3.pdf][Prédicteurs linéaires]] --- [[file:td3.pdf][TD]] ([[file:td3-correction.pdf][correction]]) --- [[file:tp3.pdf][TP]]
  (correction: [[file:tp3-correction.html][html]], [[file:tp3-correction.ipynb][jupyter]])
- 3 avril :: [[file:chapitre4.pdf][Validation et sélection]] --- [[file:tp4.pdf][TP]] (correction: [[file:tp4-correction.html][html]], [[file:tp4-correction.ipynb][jupyter]])
- 24 avril :: [[file:chapitre5.pdf][Régularisation]] --- [[file:td5.pdf][TD]] ([[file:td5-correction.pdf][correction]]) --- [[file:tp5.pdf][TP]] (correction: [[file:tp5-correction.html][html]], [[file:tp5-correction.ipynb][jupyter]])
- 15 mai :: [[file:chapitre6.pdf][Support vector machines]] --- [[file:td6.pdf][TD]] ([[file:td6-correction.pdf][correction]]) --- [[file:tp6.pdf][TP]] (correction: [[file:tp6-correction.html][html]], [[file:tp6-correction.ipynb][jupyter]])
- 22 mai :: [[file:chapitre7.pdf][Méthodes à noyaux -- I]] --- [[file:td7.pdf][TD]] ([[file:td7-correction.pdf][correction]]) --- [[file:tp7.pdf][TP]] (correction: [[file:tp7-correction.html][html]], [[file:tp7-correction.ipynb][jupyter]])
- 29 mai :: [[file:chapitre7.pdf][Méthodes à noyaux -- II]] --- [[file:td8.pdf][TD]] ([[file:td8-correction.pdf][correction]]) --- [[file:tp8.pdf][TP]]
- 5 juin :: Arbres de décision et méthodes ensemblistes
- 12 juin :: Examen
* Références
- Shalev-Shwartz, S., & Ben-David, S. (2014), /Understanding machine
  learning: From theory to algorithms/, Cambridge university press ---
  [[https://www.cs.huji.ac.il/~shais/UnderstandingMachineLearning/understanding-machine-learning-theory-algorithms.pdf][pdf]] --- Excellente référence, assez théorique et mathématique.
- Trevor, H., Robert, T., & JH, F. (2009), /The elements of
  statistical learning: data mining, inference, and prediction/,
  Springer-Verlag New York --- [[https://web.stanford.edu/~hastie/ElemStatLearn/printings/ESLII_print12.pdf][pdf]] --- Un grand classique.
- VanderPlas, J. (2016), /Python data science handbook: essential
  tools for working with data/, O'Reilly Media, Inc. --- [[https://tanthiamhuat.files.wordpress.com/2018/04/pythondatasciencehandbook.pdf][pdf]] --- Excellente
  référence sur les librairies =numpy=, =matplotlib=, =pandas= et =scikit-learn=.
* Variables locales                                                :noexport:
# Local Variables:
# org-html-postamble: nil
# End:
