index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="fr" xml:lang="fr">
<head>
<!-- 2020-04-23 jeu. 18:35 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Introduction au Machine learning</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Joon Kwon" />
<meta name="description" content="Page du cours d'introduction au machine learning, CPES, Université PSL"
 />
<meta name="keywords" content="joon,kwon,machine learning,cpes,psl,python,scikit-learn" />
<link rel="stylesheet" type="text/css" href="../style.css" />
</head>
<body>
<div id="content">
<h1 class="title">Introduction au Machine learning</h1>
<p>
<br />
</p>

<p>
<a href="https://cpes.univ-psl.fr/cpes/">CPES</a> &#x2014; <a href="https://www.psl.eu/">Université PSL</a> &#x2014; 2019&#x2013;2020, second semestre<br />
Le vendredi de 9h à 12h15 &#x2014; Salle L213, <a href="https://goo.gl/maps/ZMYwEwKdqrE2">MinesParisTech</a><br />
</p>

<p>
Ce cours présente les notions et algorithmes de base de
l'apprentissage supervisé. Il comporte un volet pratique avec de la
programmation en Python et la librairie <a href="https://scikit-learn.org/"><code>scikit-learn</code></a> en particulier.
</p>

<div id="outline-container-orgc4a5daa" class="outline-2">
<h2 id="orgc4a5daa">Calendrier, énoncés et corrections</h2>
<div class="outline-text-2" id="text-orgc4a5daa">
<dl class="org-dl">
<dt>13 mars</dt><dd>Introduction &#x2014; <a href="tp1.pdf">TP</a> (correction : <a href="tp1-correction.html">html</a>, <a href="tp1-correction.ipynb">jupyter</a>)</dd>
<dt>20 mars</dt><dd><a href="chapitre2.pdf">k plus proches voisins</a> &#x2014; <a href="td2.pdf">TD</a> (<a href="td2-correction.pdf">correction</a>) &#x2014; <a href="tp2.pdf">TP</a> (correction : <a href="tp2-correction.html">html</a>, <a href="tp2-correction.ipynb">jupyter</a>)</dd>
<dt>27 mars</dt><dd><a href="chapitre3.pdf">Prédicteurs linéaires</a> &#x2014; <a href="td3.pdf">TD</a> (<a href="td3-correction.pdf">correction</a>) &#x2014; <a href="tp3.pdf">TP</a>
(correction: <a href="tp3-correction.html">html</a>, <a href="tp3-correction.ipynb">jupyter</a>)</dd>
<dt>3 avril</dt><dd><a href="chapitre4.pdf">Validation et sélection</a> &#x2014; <a href="tp4.pdf">TP</a> (correction: <a href="tp4-correction.html">html</a>, <a href="tp4-correction.ipynb">jupyter</a>)</dd>
<dt>24 avril</dt><dd><a href="chapitre5.pdf">Régularisation</a> &#x2014; <a href="td5.pdf">TD</a> &#x2014; <a href="tp5.pdf">TP</a></dd>
<dt>15 mai</dt><dd>Support vector machines</dd>
<dt>22 mai</dt><dd>Méthodes à noyaux &#x2013; I</dd>
<dt>29 mai</dt><dd>Méthodes à noyaux &#x2013; II</dd>
<dt>5 juin</dt><dd>Arbres de décision et méthodes ensemblistes</dd>
<dt>12 juin</dt><dd>Examen</dd>
</dl>
</div>
</div>
<div id="outline-container-org993988d" class="outline-2">
<h2 id="org993988d">Références</h2>
<div class="outline-text-2" id="text-org993988d">
<ul class="org-ul">
<li>Shalev-Shwartz, S., &amp; Ben-David, S. (2014), <i>Understanding machine
learning: From theory to algorithms</i>, Cambridge university press &#x2014;
<a href="https://www.cs.huji.ac.il/~shais/UnderstandingMachineLearning/understanding-machine-learning-theory-algorithms.pdf">pdf</a> &#x2014; Excellente référence, assez théorique et mathématique.</li>
<li>Trevor, H., Robert, T., &amp; JH, F. (2009), <i>The elements of
statistical learning: data mining, inference, and prediction</i>,
Springer-Verlag New York &#x2014; <a href="https://web.stanford.edu/~hastie/ElemStatLearn/printings/ESLII_print12.pdf">pdf</a> &#x2014; Un grand classique.</li>
<li>VanderPlas, J. (2016), <i>Python data science handbook: essential
tools for working with data</i>, O'Reilly Media, Inc. &#x2014; <a href="https://tanthiamhuat.files.wordpress.com/2018/04/pythondatasciencehandbook.pdf">pdf</a> &#x2014; Excellente
référence sur les librairies <code>numpy</code>, <code>matplotlib</code>, <code>pandas</code> et <code>scikit-learn</code>.</li>
</ul>
</div>
</div>
</div>
</body>
</html>
